# Data Loading, Storage

In [ ]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [ ]:
# You have to upload the data by using the Files function on your dashboard

## Reading and Writing Data in Text Format

two methods:
- *read_csv*: Read a comma-separated values (csv) file into DataFrame. Also supports optionally iterating or breaking of the file into chunks.
- *to_csv*: Write object to a comma-separated values (csv) file.

### Reading Text Files

In [ ]:
df= pd.read_csv("ex1.csv", sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
 !cat "ex1.csv"
 #!cat "examples/ex1.csv"

define separator value and header

In [ ]:
# define the table sepator value

df = pd.read_csv('ex1.csv', sep='\t')
df

In [ ]:
# define if the table header exists 

df = pd.read_csv('ex1.csv', header=None)
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [ ]:
 !cat "ex2.csv"

In [ ]:
pd.read_csv('ex2.csv', sep=',', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

define column name and/or index name

In [ ]:
# define column name

pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# define index name

names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

you can skip a list of row

In [ ]:
!cat "ex4.csv"

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
pd.read_csv('ex4.csv', sep=',')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [ ]:
# you can skip a list of row
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
!cat ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [ ]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
None; np.nan

In [ ]:
pd.isnull(result)

define *na_values*

In [ ]:
result = pd.read_csv('ex5.csv', na_values=['NULL', 'one'])
result

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)
#pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading Text Files in Pieces

In [ ]:
result = pd.read_csv('ex6.csv')
result

Read only a fixed number of rows

In [ ]:
pd.read_csv('ex6.csv', nrows=5)

Read Text Files in chunks

In [ ]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)
chunker

In [ ]:
chunk = next(chunker)
chunk.head(5)

In [ ]:
for chunk in chunker:
  print("chunk size: {}".format(chunk.shape))
  break

In [ ]:
# tot = pd.Series([], dtype=float)
# for piece in chunker:
#     tot = tot.add(piece['key'].value_counts(), fill_value=0)

# tot = tot.sort_values(ascending=False)

### Writing Data to Text Format

In [ ]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
data.iloc[0,0] = 999

In [ ]:
data

  something  a   b     c   d message
0       999  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
data.to_csv('out.csv',index=False)

In [ ]:
pd.read_csv('out.csv', sep=',')

In [ ]:
!cat out.csv

In [ ]:
data.to_csv('out.csv', index=False, sep='#')

In [ ]:
pd.read_csv('out.csv', sep=';')

In [ ]:
!cat out.csv

### Reading and Writing Microsoft Excel Files

Read option 1: Using *ExcelFile* class

In [ ]:
#xlsx = pd.ExcelFile('examples/ex1.xlsx')
xlsx = pd.ExcelFile('ex1.xlsx')

In [ ]:
xlsx

In [ ]:
pd.read_excel(xlsx, 'Sheet1')

Read option 2: Using *read_excel* method

In [ ]:
frame = pd.read_excel('ex1.xlsx', 'Sheet1')
frame

Write option 1: using *ExcelWriter* object

In [ ]:
writer = pd.ExcelWriter('ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

Write option 2: using *to_excel* method

In [ ]:
frame

In [ ]:
frame.to_excel('ex2_out.xlsx')

In [ ]:
!rm examples/ex2.xlsx

### Optional: Working with Delimited Formats

In [ ]:
!cat ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [ ]:
import csv
f = open('ex7.csv')

reader = csv.reader(f)

In [ ]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [ ]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [ ]:
header

['a', 'b', 'c']

In [ ]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## Optional

In [ ]:
with open('ex3.txt', 'r') as f:
  lines = f.readlines()
lines

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [ ]:
columns = [val.strip() for val in lines[0].split(' ') if val != '']
columns

['A', 'B', 'C']

In [ ]:
data = []
for row in lines[1:]:
  res = [val.strip() for val in row.split(' ') if val != '']
  data.append(res)

In [ ]:
data

[['aaa', '-0.264438', '-1.026059', '-0.619500'],
 ['bbb', '0.927272', '0.302904', '-0.032399'],
 ['ccc', '-0.264273', '-0.386314', '-0.217601'],
 ['ddd', '-0.871858', '-0.348382', '1.100491']]

In [ ]:
columns

In [ ]:
columns.insert(0, 'index')
columns

In [ ]:
ds = pd.DataFrame(data, columns=columns)
ds

In [ ]:
ds.set_index('index')